# <a id='toc1_'></a>[**Cleaning Template**](#toc0_)

Name  
Topic  
email  
June 4th, 2023

**Table of contents**<a id='toc0_'></a>    
- [**Cleaning Template**](#toc1_)    
  - [**Load**](#toc1_1_)    
  - [**Assess**](#toc1_2_)    
    - [Visual Assessment](#toc1_2_1_)    
    - [Programmatic Assessment](#toc1_2_2_)    
    - [List of Issues to Resolve](#toc1_2_3_)    
      - [High Level Tips Cheatsheet below for reference](#toc1_2_3_1_)    
  - [**Clean**](#toc1_3_)    
    - [Issue #1:](#toc1_3_1_)    
      - [Define:](#toc1_3_1_1_)    
      - [Code](#toc1_3_1_2_)    
      - [Test](#toc1_3_1_3_)    
    - [Issue #2:....](#toc1_3_2_)    
      - [Define:](#toc1_3_2_1_)    
      - [Code](#toc1_3_2_2_)    
      - [Test](#toc1_3_2_3_)    

<!-- vscode-jupyter-toc-config
	numbering=false
	anchor=true
	flat=false
	minLevel=1
	maxLevel=6
	/vscode-jupyter-toc-config -->
<!-- THIS CELL WILL BE REPLACED ON TOC UPDATE. DO NOT WRITE YOUR TEXT IN THIS CELL -->

In [33]:
from my_code import *

In [34]:
# initialize styling params
plt.rcParams["xtick.direction"] = "in"
plt.rcParams["ytick.direction"] = "in"
plt.rcParams["font.size"] = 11.0
plt.rcParams["figure.figsize"] = (9, 6)
plt.style.use('fivethirtyeight')

sns.set_style("whitegrid")
sns.set_palette("viridis")
sns.set_context("notebook")

pd.set_option("display.max_columns", 50)
pd.set_option('display.max_colwidth', 1000)
pd.plotting.register_matplotlib_converters()
os.environ["PYTHONHASHSEED"] = "123"

# # import warnings
# warnings.filterwarnings('ignore')

## <a id='toc1_1_'></a>[**Load**](#toc0_)

In [35]:
titanic_df = sns.load_dataset('titanic')
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## <a id='toc1_2_'></a>[**Assess**](#toc0_)

### <a id='toc1_2_1_'></a>[Visual Assessment](#toc0_)

In [36]:
display(titanic_df.head())
display(titanic_df.tail())
display(titanic_df.sample(5))

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
814,0,3,male,30.5,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
393,1,1,female,23.0,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
695,0,2,male,52.0,0,0,13.5000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

### <a id='toc1_2_2_'></a>[Programmatic Assessment](#toc0_)

In [37]:

titanic_df.info()
titanic_df.describe().T

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [38]:

print(titanic_df.isna().sum())

titanic_df[titanic_df.deck.isna()].head()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [39]:
print(titanic_df.duplicated().sum())

titanic_df[titanic_df.duplicated()].head()

107

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
47,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
76,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
77,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
87,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
95,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### <a id='toc1_2_3_'></a>[List of Issues to Resolve](#toc0_)

List of Quality or Tidiness Issues found to Fix. Some issues may be found later during the EDA process. Add them here and clean while mentioning they were found later.

**Example of Quality Issues**:
1. api_df has 30 missing tweet entries compared with the twitter_df. - Completeness  
   - Check to see if there is some commonality with the missing tweets. Otherwise, consider deleting incomplete data from twitter_df. 

2. image_df has 281 less data entries as compared with twitter_df and potentially has multiple images for some entries. - Completeness
   - Check to see if there is some commonality with the missing tweets. Otherwise, consider deleting incomplete data from twitter_df. 

**Example of Tidiness Issues**:   

1. Combine the three dataframes into one master dataframe on tweet_id. - Tables   
   - Use pd.merge to merge all three dfs on tweet_id

#### <a id='toc1_2_3_1_'></a>[High Level Tips Cheatsheet below for reference](#toc0_)

**Principles of High Quality Data**:
1. **Completeness**: Do we have all of the records that we should?
2. **Validity**: We have the records, but they're not valid, i.e., they don't conform to a defined schema, also known as a defined set of rules for data.
3. **Accuracy**: Inaccurate data is wrong data that is valid. It adheres to the defined schema, but it is still incorrect.
4. **Consistency**: Inconsistent data is both valid and accurate, but there are multiple correct ways of referring to the same thing.


**Principles of Tidy Data**:   
- Tidy data is organized with three qualities in mind:
    - **Columns:** Each variable forms a column.
    - **Rows:** Each observation forms a row.
    - **Tables:** Each type of observational unit forms a table.


**Ideal Order for Addressing Issues**:

 1. **Completeness issues** or **Fix Missing Data**: It's important to do this upfront so that subsequent data cleaning will not have to be repeated.
 2. **Tidiness Issues**: Tidy datasets with data quality issues are almost always easier to clean than untidy datasets with the same issues.
 3. **Quality Control**: Address the remaining validity, accuracy, and consistency issues in that order.

## <a id='toc1_3_'></a>[**Clean**](#toc0_)

### <a id='toc1_3_1_'></a>[Issue #1:](#toc0_)

#### <a id='toc1_3_1_1_'></a>[Define:](#toc0_)


The first issues I wanted to address were all the Completeness issues. However, they would all be much easier to accomplish if I merged the 3 dfs together. This would accomplish three of my issues in one swoop. Here is my breakdown of each issue.

**Quality**:
1. api_df has 30 missing tweet entries compared with the twitter_df. - Completeness  
   - Check to see if there is some commonality with the missing tweets. Otherwise, consider deleting incomplete data from twitter_df. 

2. image_df has 281 less data entries as compared with twitter_df and potentially has multiple images for some entries. - Completeness
   - Check to see if there is some commonality with the missing tweets. Otherwise, consider deleting incomplete data from twitter_df. 

**Tidiness**:   

2. Combine the three dataframes into one master dataframe on tweet_id. - Tables   
   - Use pd.merge to merge all three dfs on tweet_id

#### <a id='toc1_3_1_2_'></a>[Code](#toc0_)

In [40]:
# master_df = pd.merge(clean_twitter_df, clean_api_df,\
#                                 how='outer', on='tweet_id', sort=True, copy=True)

# master_df = pd.merge(master_df, clean_image_df,\
#                                 how='outer', on='tweet_id', sort=True, copy=True)

# print(master_df.columns)

# master_df.info()
# master_df.head()

NameError: name 'clean_twitter_df' is not defined

#### <a id='toc1_3_1_3_'></a>[Test](#toc0_)

In [ ]:
# master_df.info()

### <a id='toc1_3_2_'></a>[Issue #2:....](#toc0_)

#### <a id='toc1_3_2_1_'></a>[Define:](#toc0_)

#### <a id='toc1_3_2_2_'></a>[Code](#toc0_)

#### <a id='toc1_3_2_3_'></a>[Test](#toc0_)